; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	spectrograph0 - mode
	image1 - mode
	infrared2 - mode
	GroundStation1 - direction
	Star3 - direction
	GroundStation2 - direction
	Star9 - direction
	Star10 - direction
	Star7 - direction
	Star6 - direction
	GroundStation4 - direction
	GroundStation8 - direction
	Star5 - direction
	GroundStation11 - direction
	Star0 - direction
	Star12 - direction
	Planet13 - direction
	Phenomenon14 - direction
	Phenomenon15 - direction
	Planet16 - direction
	Planet17 - direction
	Planet18 - direction
)
(:init
	(supports instrument0 infrared2)
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation1)
	(supports instrument1 image1)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 Star6)
	(calibration_target instrument1 GroundStation4)
	(calibration_target instrument1 Star9)
	(supports instrument2 infrared2)
	(supports instrument2 spectrograph0)
	(supports instrument2 image1)
	(calibration_target instrument2 Star6)
	(calibration_target instrument2 Star7)
	(calibration_target instrument2 Star5)
	(calibration_target instrument2 Star10)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star7)
	(supports instrument3 infrared2)
	(supports instrument3 image1)
	(calibration_target instrument3 GroundStation4)
	(supports instrument4 spectrograph0)
	(calibration_target instrument4 Star0)
	(calibration_target instrument4 GroundStation11)
	(calibration_target instrument4 Star5)
	(calibration_target instrument4 GroundStation8)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet18)
)
(:goal (and
	(have_image Star12 image1)
	(have_image Planet13 image1)
	(have_image Phenomenon14 image1)
	(have_image Phenomenon15 infrared2)
	(have_image Planet16 image1)
	(have_image Planet17 image1)
	(have_image Planet18 infrared2)
))

)

; plan
1. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 7
2. (calibrate satellite1 instrument2 star7)
   added: (calibrated instrument2)
   goals met: 0 of 7
3. (turn_to satellite1 planet16 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 planet16)
   goals met: 0 of 7
4. (take_image satellite1 planet16 instrument2 image1)
   added: (have_image planet16 image1)
   goals met: 1 of 7
5. (turn_to satellite1 planet13 planet16)
   deleted: (pointing satellite1 planet16)
   added: (pointing satellite1 planet13)
   goals met: 1 of 7
6. (take_image satellite1 planet13 instrument2 image1)
   added: (have_image planet13 image1)
   goals met: 2 of 7
7. (turn_to satellite1 phenomenon15 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 phenomenon15)
   goals met: 2 of 7
8. (take_image satellite1 phenomenon15 instrument2 infrared2)
   added: (have_image phenomenon15 infrared2)
   goals met: 3 of 7
9. (turn_to satellite1 phenomenon14 phenomenon15)
   deleted: (pointing satellite1 phenomenon15)
   added: (pointing satellite1 phenomenon14)
   goals met: 3 of 7
10. (take_image satellite1 phenomenon14 instrument2 image1)
   added: (have_image phenomenon14 image1)
   goals met: 4 of 7
11. (turn_to satellite1 planet17 phenomenon14)
   deleted: (pointing satellite1 phenomenon14)
   added: (pointing satellite1 planet17)
   goals met: 4 of 7
12. (take_image satellite1 planet17 instrument2 image1)
   added: (have_image planet17 image1)
   goals met: 5 of 7
13. (turn_to satellite1 planet18 planet17)
   deleted: (pointing satellite1 planet17)
   added: (pointing satellite1 planet18)
   goals met: 5 of 7
14. (take_image satellite1 planet18 instrument2 infrared2)
   added: (have_image planet18 infrared2)
   goals met: 6 of 7
15. (turn_to satellite1 star12 planet18)
   deleted: (pointing satellite1 planet18)
   added: (pointing satellite1 star12)
   goals met: 6 of 7
16. (take_image satellite1 star12 instrument2 image1)
   added: (have_image star12 image1)
   goals met: 7 of 7
